mule/mule32/MuleWSProxyDemo/src/main/resources/AdmissionService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="Admission" targetNamespace="http://www.mule-health.com/SOA/service/admission/1.0" xmlns:mes="http://www.mule-health.com/SOA/message/1.0" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.mule-health.com/SOA/service/admission/1.0" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <wsdl:types>
<xsd:schema xmlns:mes="http://www.mule-health.com/SOA/message/1.0" 
            xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
            xmlns:tns="http://www.mule-health.com/SOA/service/admission/1.0" 
            xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
            xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<xsd:import namespace="http://www.mule-health.com/SOA/message/1.0" 
                    schemaLocation="AdmissionService.xsd"/>
</xsd:schema>
  </wsdl:types>
  <wsdl:message name="admitSubjectResponse">
    <wsdl:part element="mes:admitSubjectResponse" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="admitSubject">
    <wsdl:part element="mes:admitSubject" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="Admission">
    <wsdl:operation name="admitSubject">
      <wsdl:input message="tns:admitSubject">
    </wsdl:input>
      <wsdl:output message="tns:admitSubjectResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="AdmissionSoap" type="tns:Admission">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="admitSubject">
      <soap:operation soapAction="http://http://www.mule-health.com/SOA/service/admission/1.0/admitSubject"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="AdmissionService">
    <wsdl:port binding="tns:AdmissionSoap" name="AdmissionPort">
      <soap:address location="http://hospital-admission.cloudhub.io/AdmissionService"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>