xml-only-soap-webservice/src/test/resources/message.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.mule-health.com/SOA/message/1.0" xmlns:ns1="http://www.mule-health.com/SOA/model/1.0"><soapenv:Header/><soapenv:Body><ns:admitSubject><ns1:Referer><clientId>1234</clientId></ns1:Referer><ns1:Referral><procedure><code>1234</code><admission>ELECTIVE</admission><department>Cardiology</department></procedure></ns1:Referral><ns1:Subject><nationalId>1234</nationalId><firstName>Nial</firstName><lastName>Darbey</lastName><address1>BuenosAires</address1><nationality>Irish</nationality><gender>Male</gender><dateOfBirth>1970-08-07</dateOfBirth></ns1:Subject></ns:admitSubject></soapenv:Body></soapenv:Envelope>